controllers/AsiaebuyMenuController.php

SELECT * FROM `asiaebuy_menu` WHERE `id`='10'
---
    protected function findModel($id)
    {
        if (($model = AsiaebuyMenu::findOne($id)) !== null) {