controllers/AsiaebuyHistoryController.php

    public function actionCreate($menu_id)
    {
        $model = new AsiaebuyHistory();

        $menu = AsiaebuyMenu::find()->where(['id'=>$menu_id])->one();
---
SELECT * FROM `asiaebuy_menu` WHERE `id`='11'

    protected function findModel($id)
    {
        if (($model = AsiaebuyHistory::findOne($id)) !== null) {
---
SELECT * FROM `asiaebuy_history` WHERE `id`='16'